# SQL 的五十道練習：初學者友善的資料庫入門

> 附錄四：以 R 語言串接學習資料庫

假使讀者不是資料科學的初學者，對於 R 以及模組有一定的認識與暸解，可以使用模組 `RSQLite` 與 `DBI` 建立學習資料庫的連線、使用模組並且對學習資料庫進行資料查詢。

## 安裝模組

使用 `install.packages()` 函數在 R 語言環境中安裝模組 `RSQLite` 與 `DBI`。

```r
install.packages("RSQLite")
install.packages("DBI")
```

## 載入模組

In [1]:
library("DBI")

## 建立連線

以相對路徑位於 `../databases/imdb.db` 的學習資料庫為例，使用 `DBI` 模組的 `dbConnect()` 函數。

In [2]:
con <- dbConnect(RSQLite::SQLite(), "../databases/imdb.db")

## 列出學習資料庫中的所有資料表

使用 DBI 模組的 `dbListTables()` 函數。

In [3]:
print(dbListTables(con))

[1] "actors"  "casting" "movies"

## 列出指定資料表所有的欄位名稱

使用 `DBI` 模組的 `dbListFields()` 函數。

In [4]:
print(dbListFields(con, "actors"))

[1] "id"   "name"

In [5]:
print(dbListFields(con, "casting"))

[1] "movie_id" "actor_id" "ord"

In [6]:
print(dbListFields(con, "movies"))

[1] "id"           "title"        "release_year" "rating"       "director"
[6] "runtime"

## 進行資料查詢

使用 `DBI` 模組的 `dbGetQuery()` 函數。

In [7]:
sql_statement <- "
SELECT *
  FROM actors
 LIMIT 5;
"
dbGetQuery(con, sql_statement)

  id name
1 1  Aamir Khan
2 2  Aaron Eckhart
3 3  Aaron Lazar
4 4  Abbas-Ali Roomandi
5 5  Abbey Lee

In [8]:
sql_statement <- "
SELECT *
  FROM casting
 LIMIT 5;
"
dbGetQuery(con, sql_statement)

  movie_id actor_id ord
1 1        2944     1
2 1        2192     2
3 1         330     3
4 1        3134     4
5 1         552     5

In [9]:
sql_statement <- "
SELECT *
  FROM movies
 LIMIT 5;
"
dbGetQuery(con, sql_statement)

  id title                    release_year rating director             runtime
1 1  The Shawshank Redemption 1994         9.3    Frank Darabont       142
2 2  The Godfather            1972         9.2    Francis Ford Coppola 175
3 3  The Dark Knight          2008         9.0    Christopher Nolan    152
4 4  The Godfather Part II    1974         9.0    Francis Ford Coppola 202
5 5  12 Angry Men             1957         9.0    Sidney Lumet          96

## 關閉連線

使用 `DBI` 模組的 `dbDisconnect()` 函數。

In [10]:
dbDisconnect(con)

## 延伸閱讀

- Databases using R <https://db.rstudio.com/>
- RSQLite <https://rsqlite.r-dbi.org/>
- DBI <https://dbi.r-dbi.org/>